class Deck #для карт сделал отдельный класс, т.к. при необходимости, что-то поменять в логике работы программы этот класс останется нетронутый
  attr_reader :deck
  def initialize
    @deck = ["T♥", "2♥", "3♥", "4♥", "5♥", "6♥", "7♥", "8♥", "9♥", "10♥", "11♥", "J♥", "Q♥", "K♥",
             "T♦", "2♦", "3♦", "4♦", "5♦", "6♦", "7♦", "8♦", "9♦", "10♦", "11♦", "J♦", "Q♦", "K♦",
             "T♣", "2♣", "3♣", "4♣", "5♣", "6♣", "7♣", "8♣", "9♣", "10♣", "11♣", "J♣", "Q♣", "K♣",
             "T♠", "2♠", "3♠", "4♠", "5♠", "6♠", "7♠", "8♠", "9♠", "10♠", "11♠", "J♠", "Q♠", "K♠"]
  end

  def get_card
    rand_card = @deck[rand(@deck.size)]
    @deck.delete(rand_card)
  end
end
